# 22-09-05 Mon

# setting

In [1]:
print ("hello world!")

hello world!

sql 설치는
**pip install ipython-sql**이었던 것 같음

In [2]:
%load_ext sql

In [3]:
%sql sqlite:///db_2022.db

# create table

### create format

In [24]:
%%sql
create table instructor ( # create table [table name]
ID char(5), # [attribute name] [domain type]
name varchar(20) not null,
dept_name varchar(20),
salary numeric(8,2))
# primary key([attribute name])
# foreign key([attribute name]) references [table name]
# -> 상속해"주는" table만 하면 된다

 * sqlite:///db_2022.db
(sqlite3.OperationalError) table instructor already exists
[SQL: create table instructor (
ID char(5),
name varchar(20) not null,
dept_name varchar(20),
salary numeric(8,2))]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

# update

### insert, delete, drop, alter format

In [25]:
%sql insert into instructor values ('10211','smith','Biology', 66000)
# insert into [table] values ([tuple value])
# delete from [table] ()
# drop table [table]
# alter table [table] add [attribute] [domain]

 * sqlite:///db_2022.db
1 rows affected.

[]

In [5]:
%sql insert into instructor values ('10212',null,'Biology', 66000)

 * sqlite:///db_2022.db
(sqlite3.IntegrityError) NOT NULL constraint failed: instructor.name
[SQL: insert into instructor values ('10212',null,'Biology', 66000)]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

In [7]:
%sql insert into instructor values ('10212','David','Biology', 66000)

 * sqlite:///db_2022.db
1 rows affected.

[]

# select

- select * : all attribute

    **select * from [table]**
    
    --> 파이[attribute] ([table])
- select all : duplicate ok

    **select all [attribute] from [table]**
- select distinct : duplicate no

    **select distinct [attribute] from [table]**
- select (except from) : just value 1x1

    **select '[value]'**
- select as : rename

    **select [attribute] as [new attribute name]**
- select where

    **select [attribute] from [table] where [condition]**
    - in from, [table1]x[table2] 가능

In [6]:
%sql select * from instructor

 * sqlite:///db_2022.db
Done.

[('10101', 'David', 'Biology', 60000), ('10211', 'smith', 'Biology', 66000)]

In [8]:
%sql drop table instructor

 * sqlite:///db_2022.db
Done.

[]

In [9]:
%%sql
create table instructor (
ID char(5),
name varchar(20) not null,
dept_name varchar(20),
salary numeric(8,2),
primary key (ID))

 * sqlite:///db_2022.db
Done.

[]

In [10]:
%sql insert into instructor values ('10101','Adam','Biology',66000)

 * sqlite:///db_2022.db
1 rows affected.

[]

In [11]:
%sql insert into instructor values ('10101','David','Biology',66000)

 * sqlite:///db_2022.db
(sqlite3.IntegrityError) UNIQUE constraint failed: instructor.ID
[SQL: insert into instructor values ('10101','David','Biology',66000)]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

In [12]:
%sql insert into instructor values ('10104','Adam2','Biology',66000)

 * sqlite:///db_2022.db
1 rows affected.

[]

In [13]:
%sql drop table instructor

 * sqlite:///db_2022.db
Done.

[]

# PRAGMA

In [21]:
%sql PRAGMA foreign_keys = ON;
# foreign key constraint가 원래는 default
# PRAGMA를 해야 공란으로 남겨두면 x

 * sqlite:///db_2022.db
Done.

[]

In [15]:
%%sql
create table instructor (
ID char(5),
name varchar(20) not null,
dept_name varchar(20),
salary numeric(8,2),
primary key (ID),
foreign key (dept_name) references department)

 * sqlite:///db_2022.db
Done.

[]

In [16]:
%sql insert into instructor values ('10101','David','Biology','60000')

 * sqlite:///db_2022.db
(sqlite3.OperationalError) no such table: main.department
[SQL: insert into instructor values ('10101','David','Biology','60000')]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [17]:
%%sql
create table department (
dept_name varchar(20) primary key,
building varchar(20),
budget int)

 * sqlite:///db_2022.db
Done.

[]

In [18]:
%sql insert into instructor values ('10101','David','Biology','60000')

 * sqlite:///db_2022.db
(sqlite3.IntegrityError) FOREIGN KEY constraint failed
[SQL: insert into instructor values ('10101','David','Biology','60000')]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

In [19]:
%sql insert into department values ('Biology','A-dong','60000')

 * sqlite:///db_2022.db
1 rows affected.

[]

In [20]:
%sql insert into instructor values ('10101','David','Biology','60000')

 * sqlite:///db_2022.db
1 rows affected.

[]